# 基础

[Redis](http://www.redis.cn/) 是一个开源（BSD许可）的，内存中的数据结构存储系统，它可以用作数据库、缓存和消息中间件。

[在线体验](https://try.redis.io/) 

## 1. 安装

**Docker 安装**

```bash
docker pull redis:latest
docker run -itd --name redis-test -p 6379:6379 redis
```

测试安装结果：

```bash
docker exec -it my_redis /bin/bash
root@ad2da796a4bb:/data# redis-cli
127.0.0.1:6379> set test 1
OK
127.0.0.1:6379> get test
"1"
```

## 2. 基本使用

Redis 一共有16个数据库(0-15号)。支持五大数据类型：**String** （字符串）、**Hash**（哈希）、**List**（列表）、**Set**（集合）和**ZSet**（有序集合）。

### 2.1 基本操作

```bash
# 切换数据库
> SELECT 0
# 查看当前数据库键值对数量
> dbsize
(integer) 1
# 清空当前数据库键值对和所有数据库键值对
> FLUSHDB 
OK
> FLUSHALL
OK
```

关于key的几条规则：

- 太长的键值不是个好主意，例如1024字节的键值就不是个好主意，不仅因为消耗内存，而且在数据中查找这类键值的计算成本很高。
- 太短的键值通常也不是好主意，如果你要用”u:1000:pwd”来代替”user:1000:password”，这没有什么问题，但后者更易阅读，并且由此增加的空间消耗相对于key object和value object本身来说很小。当然，没人阻止您一定要用更短的键值节省一丁点儿空间。
- 最好坚持一种模式。例如：”object-type:id:field”就是个不错的注意，像这样”user:1000:password”。我喜欢对多单词的字段名中加上一个点，就像这样：”comment:1234:reply.to”。

## 2.2 字符串

String 类型是二进制安全的，可以保存图片等二进制数据，最大512M。

```bash
# 添加或者修改key-value
> set mykey 1
OK
# 根据key获取value
> get mykey
"1"
> get name
(nil)
# 查询所有key
> keys *
1) "mykey"
# 删除,1：删除成功，0：删除失败
> DEL name
(integer) 1
```

### 2.2.1 数据在限定时间内存活

你可以对key设置一个超时时间，当这个时间到达后会被删除。精度可以使用毫秒或秒。

```bash
> set name ryw ex 10
OK
> get name
"ryw"
# 10秒之后
> get name
(nil)
# 或者先设置值再设置时间
> set name ryw ex 10
OK
> expire name 5
(integer) 1
# 查看存活时间
> ttl name
(integer) 2
# 删除存活设置
> PERSIST name
(integer) 1
```

### 2.2.2 多个值

```bash
> mset a 10 b 20 c 30
OK
> mget a b c
1) "10"
2) "20"
3) "30"
```

## 2.3 Hash

Hash 是键值对集合。适合存储对象。

```bash
# user 是集合，name是字段名，ryw是值，以此类推
> HSET user name ryw age 29
(integer) 2
> hget user name
"ryw"
> hget user age
"29"
# 获取多个值
> hmget user name age
1) "ryw"
2) "29"
# 显示所有键
> HKEYS user
1) "name"
2) "age"
# 显示所有内容
> HGETALL user
1) "name"
2) "ryw"
3) "age"
4) "29"
```

## 2.4 List

Redis lists基于Linked Lists实现。这意味着即使在一个list中有数百万个元素，在头部或尾部添加一个元素的操作，其时间复杂度也是常数级别的。

```bash
# 头部（左边）添加元素
> LPUSH mlist 1 2 3 4 5 6
(integer) 6
# 尾部（右边）添加元素
> RPUSH mlist 9 8 7
(integer) 9
# 范围查询，-1表示最后一个
> LRANGE mlist 0 -1
1) "6"
2) "5"
3) "4"
4) "3"
5) "2"
6) "1"
7) "9"
8) "8"
9) "7"
# 弹出右边元素
> RPOP mlist
"7"
# 弹出左边元素
> LPOP mlist
"6"
# 从左边截取，左右都包含
> LTRIM mlist 0 4
OK

```

**常用案例**

比如实现聊天系统和不同进程间传递消息的队列。

Redis提供了阻塞式访问 [BRPOP](http://www.redis.cn/commands/brpop.html) 和 [BLPOP](http://www.redis.cn/commands/blpop.html) 命令。 消费者可以在获取数据时指定如果数据不存在阻塞的时间，如果在时限内获得数据则立即返回，如果超时还没有数据则返回null, 0表示一直阻塞。

## 2.5 Set

Set 是 String 的无序排列。底层是HashTable数据结构。元素不能重复。

Sets 适合用于表示对象间的关系。 例如，我们可以轻易使用 set 来表示标记。

```bash
# 添加元素
> SADD mset 1 2 3 4 5 6
(integer) 6
# 遍历元素
> SMEMBERS mset
1) "1"
2) "2"
3) "3"
4) "4"
5) "5"
6) "6"
# 是否包含
> SISMEMBER mset 5
(integer) 1
> SISMEMBER mset 0
(integer) 0
# 删除元素
> srem mset a
(integer) 1
```

其他操作还有求集合的并集、交集等，看文档。